# TableData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableData Methods
TableData Class See Also
---
The TableData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSectionData(Int32) | Returns the section data array element at the specified index. |
| GetSectionData(SectionType) | Returns the pointer to the section data array element at the specified section type. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqual | Checks if this element is equal in value to the other element. |
| IsValidZoomLevel | Verifies if the value of zoom level is valid. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
TableData Class
Autodesk.Revit.DB Namespace